import Olivie from "./Pictures/Олів'є.jpg";
import Shuba from "./Pictures/Оселедець під шубою.jpeg";
import Sharlotka from "./Pictures/Шарлотка.jpg";
import Deruny from "./Pictures/Деруни.jpg";
import Kachka from "./Pictures/Качка по-пекінськи.jpg";
import Mlyntsi from "./Pictures/Млинці.jpeg";
import Pelmeni from "./Pictures/Пельмені.jpg";
import Borshch from "./Pictures/Борщ.jpg";
import SalatMorkva from "./Pictures/Морквяний салат.jpg";
import Kharcho from "./Pictures/Суп харчо.jpg";
import Soyevyi_Sous from "./Pictures/Соєвий соус.jpg";
export let Recipes = {
  Data: [
    {
      key: 1,
     Id: 1,
      category: "3",
      name: "Шарлотка",
      image: Sharlotka,
      difficulty: "2",
      time: 10,
      everyday: 1,
      ingredients:
        " Яблука 4-5 шт.; Пшеничне борошно 1 ст.; Цукор 1 ст.; Розпушувач 1/2 ч. л.",
      steps:
        "Зваріть яблучний конфітюр. Очистьте від шкірки 7 яблук, розріжте на четвертинки та приберіть насіння. Потім наріжте на крупні шматки. Викладіть в сотейник, додайте 400 г цукру, 200 мл води, 10 мл коньяку, 50 г помитих родзинок та по дрібці кориці і духмяного меленого перцю. Варіть конфітюр на середньому вогні 15-20 хвилин. У вас має вийти досить густа суміш. Увімкніть духовку розігріватися до 180 градусів.; В сотейнику розтопіть 150 г вершкового масла 82,5%.; Зріжте скоринки з 200 г тостового житнього хліба. Візьміть круглу форму, діаметром 20 см. Частину тостів, яку будете викладати на дно форми, занурте у вершкове масло.; Тепер треба зробити бортики. Для цього тости, які залишилися розріжте на прямокутники. Кожен занурте у вершкове масло та викладайте по бортиках форми щільно, трішки навіть заходячи один до одного. Вони мають створити стіночки для нашого конфітюру.;Всередину викладіть яблучний конфітюр та притрусіть зверху 50 г панірувальних сухарів.;Ставте запікатися на 25 хвилин за температури 180 градусів.; Після цього дістаньте шарлотку, накрийте форму тарілкою та переверніть її. За бажанням зверху полийте шарлотку медом та подавайте теплою до столу.",
    },
    {
      key: 2,
      Id: 2,
      category: "5",
      name: "Оселедець під шубою",
      image: Shuba,
      difficulty: "1",
      time: 50,
      everyday: 0,
      ingredients: "",
      steps: "",
    },
    {
      key: 3,
     Id: 3,
      category: "3",
      name: "Млинці",
      image: Mlyntsi,
      difficulty: "1",
      time: 20,
      everyday: 1,
      ingredients: "",
      steps: "",
    },
    {
      key: 4,
      Id: 4,
      category: "2",
      name: "Деруни",
      image: Deruny,
      difficulty: "3",
      time: 40,
      everyday: 1,
      ingredients:
        "700 г картоплі;2 середні цибулини;1 яйце,2 ст. ложки борошна (але багато хто робить без борошна і це теж ДУЖЕ смачно);олія;мелений чорний перець за смаком;сіль за смаком",
      steps:
        "Картоплю та цибулю очистити. При цьому очищену картоплю не варто опускати в холодну воду, адже з неї вийде частина крохмалю.;Якщо маса вийшла досить рідкою, потрібно злити трохи зайвої рідини, прикриваючи загальну масу ножем. Далі додати трохи борошна, щоб отримати потрібну консистенцію. Можна борошна і не додавати, однак, якщо картопля з низьким вмістом крохмалю, завдяки йому деруни не будуть розвалюватися.;Розігріти сковороду, налити трішки олії. Смажити деруни на середньому вогні. Готові деруни викласти на серветки або паперові рушники, щоб стекла зайва олія.;Деруни можна подавати зі сметаною, або ж зробити соус.;Приготування соусу. Сир перетерти на сметану через дрібне сито. Добре перемішати, злегка посолити, додати розчавлений часник та зелень. Перемішати все до однорідної маси.",
    },
    {
      key: 5,
      Id: 5,
      category: "2",
      name: "Пельмені",
      image: Pelmeni,
      difficulty: "2",
      time: 30,
      everyday: 1,
      ingredients: "",
      steps: "",
    },
    {
      key: 6,
     Id: 6,
      category: "1",
      name: "Борщ",
      image: Borshch,
      difficulty: "2",
      time: 60,
      everyday: 1,
      ingredients: "",
      steps: "",
    },
    {
      key: 7,
      Id: 7,
      category: "5",
      name: "Салат з моркви",
      image: SalatMorkva,
      difficulty: "1",
      time: 15,
      everyday: 1,
      ingredients: "",
      steps: "",
    },
    {
      key: 8,
      Id: 8,
      category: "1",
      name: "Суп харчо",
      image: Kharcho,
      difficulty: "2",
      time: 100,
      everyday: 0,
      additional:
        "У різних областях Грузії готують суп харчо по-різному. Ми представляємо класичний грузинський рецепт супу харчо українською зі звичних для нашого столу інгредієнтів. Можна використовувати яловичину, якщо хочете суп харчо нежирний, баранину – харчо буде більш поживним та калорійним.Помідори у рецепті супу харчо додають необхідну кислість замість аличі. Або можна використовувати чорнослив чи гранатовий сік. І не варто забувати головний секрет, як приготувати суп харчо в домашніх умовах – пряних спецій і зелені не шкодувати.",
      ingredients:
        "500 гр яловичини;2 ріпчастих цибулі;4 ст. л. рису;500 гр помідорів;100 гр волоських горіхів;50 гр кореня селери;2 ч. л. томатної пасти;0,50 стручка гострого перцю;50 гр вершкового масла;Лавровий лист;Кріп, петрушка на смак; 5 зубчиків часнику;Чорний перець, сіль;Спеції, хмелі-сунелі",
      steps:
        "М'ясо ріжемо шматочками та опускаємо в каструлю з 3 л води. Включаємо максимальний вогонь і накриваємо каструлю кришкою. Під час закипання бульйону обов'язково прибираємо піну, що утворилася. Солимо.;Очищаємо на нарізаємо корінь селери. Додаємо шматочки селери та стебла петрушки. Вогонь робимо мінімальним, варимо 1 годину під кришкою.;Промиваємо рис холодною водою. Чистий рис заливаємо водою і залишаємо так постояти.;Після 15 хвилин варіння бульйону знімаємо з каструлі кришку та виймаємо стебла петрушки. Варимо ще 45 хвилин.;Волоські горіхи та цибулю подрібнюємо блендером – окремо одне від одного.;Томати обшпарюємо окропом, залишаємо на 2-3 хвилини та очищаємо від шкірки. Нарізаємо маленькими шматочками.;З половинки гострого перцю вичищаємо насіння, а сам перець подрібнюємо тонкими смужками.;На розігрітій з вершковим маслом сковороді обсмажуємо цибулю до золотистого кольору. Додаємо до неї помідори. Тримаємо під кришкою 5 хвилин.;Після додаємо гострий перець, томатну пасту, чорний мелений перець, солимо та тушкуємо все разом 5 хвилин під кришкою.;Через годину варіння бульйону дістаємо з каструлі м'ясо. Додаємо шматочки яловичини у сковороду до овочів. Перемішуємо і тримаємо під кришкою на вогні ще 5 хвилин.;Додаємо засмажку до бульйону. Під кришкою доводимо до кипіння.;Додаємо рис і варимо на повільному вогні 20 хвилин.Листя петрушки подрібнюємо та перекладаємо в невеликий посуд. До неї вичавлюємо часник і розминаємо все ложкою.;Через 10-15 хвилин варіння додаємо у каструлю хмелі-сунелі, лавровий лист, подрібнені волоські горіхи та зелень з часником. Вимикаємо газ і даємо готовому супу настоятися під кришкою ще 15 хвилин.",
    },
    {
      key: 9,
      Id: 9,
      category: "8",
      name: "Соєвий соус",
      image: Soyevyi_Sous,
      difficulty: "1",
      time: 15,
      everyday: 0,
      ingredients: "",
      steps: "",
    },
  ],
};

